# -*- coding: UTF-8 -*-
import vk_api
import json
import time
import random

from vk_api.bot_longpoll import VkBotEventType
from vk_api.longpoll import VkLongPoll, VkEventType
from config import main_token
from generator import g

vk_session = vk_api.VkApi(token=main_token)
vk = vk_session.get_api()
longpoll = VkLongPoll(vk_session)





def sender(id, text):
	vk_session.method('messages.send', {'chat_id' : id, 'message' : text, 'random_id' : 0 })

###функция отправки изображений
def sender_img(id, url):
    vk.messages.send(chat_id = id, attachment = url, random_id = 0)


while True:
	for event in longpoll.listen():
		if event.type == VkEventType.MESSAGE_NEW:
			if event.to_me:

					if event.from_chat:

						msg = event.text.lower()
						id = event.chat_id

						#сет чаров которые не записываются в логи
						chars=set('😦😧😨😰😥😢😭😱😖😣😞😓😩😫😷🤒🤕🤢🤮🤧😈🤬😡😠😤🤯😵🥴🥵🥶👿💀☠💩🤡👹👺👻👽👾😾😿🙀😽😼😻😹😸😺🤖🙈🙉🙊🦠👍🏻👊🏻🖐🏻🦵🏻🦶🏻✋🏻🤛🏻👎🏻👌🏻🤜🏻🖖🏻👂🏻💅🏻🤳👃🏻👏🏻👈🏻✌🏻🤞🏻👉🏻🙌🏻🧠👫👭🦷👐🏻👆🏻🤟🏻🤘🏻👇🏻🤲🏻🦴👬👩‍❤‍💋‍👨👨‍❤‍💋‍👨👩‍❤‍💋‍👩👅👁👀🦴🦷👐🏻🤲🏻🤝🏻🙏🏻🙏🏻💪🏻🤚🏻🤚🏻✊🏻🖕🏻👋🏻☝🏻🤙🏻🤘🏻👇🏻👆🏻👆🏻🤟🏻🦷🦵🏻👄✍🏻💅🏻🤳👫👭👬👩‍❤‍💋‍👨👨‍❤‍💋‍👨👩‍❤‍💋‍👩👱🧑👧👦🧒👶👪👩‍❤‍👩👨‍❤‍👨👩‍❤‍👨👨🧔👱‍♂👨‍🦰👨‍🦱👨‍🦳👨‍🦲👩👱‍♀👩‍🦰🙎‍♀🙎‍♂🙍‍♀🙍‍♂👵👴🧓👩‍🦲👩‍🦳👩‍🦱🙅‍♂🤦‍♂🤦‍♀🙅‍♀🙆‍♂🤷‍♂🤷‍♀🙆‍♀💁‍♂💆‍♂💆‍♀💁‍♀🙋‍♂💇‍♂💇‍♀🙋‍♀🙇‍♂🚶‍♂🚶‍♀🙇‍♀👼🧚‍♀🧚‍♂🧖‍♀🧖‍♂🧙‍♀🦹‍♀👯‍♀👯‍♂🦹‍♀🦹‍♂🕴🕺🦸‍♀🦸‍♂💃🏃‍♀🤶🎅🏃‍♂🧛‍♂👨‍⚕👨‍🍳👨‍💻👨‍🚒🤴🛀🛌👸👩‍🚒👩‍🍳👩‍💻👩‍⚕🧛‍♀🧜‍♂👨‍🎓👨‍🔧👨‍🎤👮‍♂👳‍♂👳‍♀👮‍♀👩‍🎤👩‍🔧👩‍🎓🧜‍♀🧝‍♂🧝‍♂🧝‍♀👩‍🏫👨‍🏫👨‍🏭👩‍🏭👩‍🎨👩‍🎨👨‍🎨🕵‍♂🕵‍♀🧕👲🤵👰💂‍♀💂‍♂👨‍✈👩‍✈👩‍💼👨‍💼👨‍⚖👩‍⚖🧞‍♀🧞‍♂🧟‍♂🧟‍♀👩‍🌾👨‍🌾👨‍🔬👩‍🔬👩‍🚀👨‍🚀👷‍♂👷‍♀🤱🤰🛌🛀💋💕💥🗣🎼🚮❗🆘🚾🎵👤💫💟❤💔💜🕳👥🎶🚭⛔🚫✅⚠👣💣🧡❣💘💛💬🔇🚸♻🚳🚯⚕☢🔊👁‍🗨💚💝💖💙🗨📢☣🔱🚱🚷‼🆚📣🗯🖤💗💓💞💢💯💭💤🔕🔔🆓🆕❓⁉📵🔞🐵🐒🐶🦍🐕🐩🐺🦊🦝🐱🦌🦓🦄🐎🐴🐆🐅🐯🦁🐈🐮🐂🐃🐄🐷🐽🐖🐗🐏🐑🐁🐭🦛🦏🐘🦒🦙🐫🐪🐐🐀🐹🐰🐇🐿🦔🦇🐻🐨🐼🐦🐥🐤🐣🐓🐔🦃🐾🦡🦘🐧🕊🦅🦆🦢🦉🦚🦜🐸🐊🐢🐍🐠🐠🐲🐲🦕🦖🦖🐳🐋🐋🐬🐚🐚🦑🦑🦐🦞🦞🦀🦀🐙🦈🐡🐠🐟🐌🐌🦋🐛🐜🐞🦗🕷🦂🌼🌻🌺🥀🌹🏵🏵🌸💐💐🦟🌷🌳🌲🌲🎄🎄🌴🌵🌾🌱🌿☘🌖🌕🌕🌔🌓🌒🍃🍂🍁🍁🌗🌘🌙🌚🌛🌜🌡☀🌝🌞💧☂🌧🌦🌂💦🔥🌈🌥🌤🌀☄⛄💨💨⛈⛅⛅🌬☃❄🌫☁☁🌚🌙🌠🌪🌪⚡⛱🌩🌟🌘🌘🌗🌗⭐🌨☔🌊🌒🌔🌔🌒🌑🍂🍁🌓🌕🌖🌗🌙🌚🏻😀😃😄😁😅😆😂🤣😉😊☺🙂🙃😇😗😙😚😘😍🥰🤩😋🤗😜🤪😛😝🤑🤭🤐🤥😬🙄😑😐🧐🤨🤔😶🤫😏😌🤤😴🤓😎🥳🤠😒😔🥺😳😲😯😮☹🙁😟😕😪⭐🌟☁🌠⛅⛈🌤🌥🌦🌧☂💧💦🌂🌈🔥☄🌀💨⛄☃🌬🌫❄⚡🌪🌩⛱🌨☔☔🌊🍏🍉🍊🍎🍐🍋🍌🍅🥝🍍🥭🍑🍒🥥🥑🍓🍇🍆🥔🍈🍞🥓🥩🌰🥜🍗🍖🍄🥦🧀🥞🥬🥒🥯🥨🌶🌽🥖🥐🥕🍔🥘🍲🍟🍕🥣🥗🌭🥪🍿🧂🌮🌯🥫⚽🏏🏑⚾🥎🏒🥍🏀🏐🏓🏸🏈🏉🥊🥋🎾🥅🥅🎳⛳🎮⛷🏇🎱🎯🤺🧗‍♀🥌🛷🧗‍♂♟🎿🛹🧩🎲🎽🎣🎣🕹⛸🏂🏌‍♂🏋‍♂⛹‍♀🏌‍♀🏋‍♀🚴‍♂🏄‍♂🏄‍♀🚴‍♀🚵‍♂🚣‍♂🚣‍♀🚵‍♀🤸🏊‍♂🏊‍♀🤼‍♂🤼‍♀⛹‍♂🏆🎖🧘‍♀🧘‍♂🤹‍♀🤹‍♂🤾‍♀🤾‍♂🤽‍♀🤽‍♂🏅🥇🥈🥉🍱🥙🥚🍘🍙🍳🥮🎂🥛🥛🍻🍼🍪🍥🍤🍩🍯🍺🍹🍮🍨🍣🍢🍠🍦🍧🍭🍬🍷🍸🍾🍫🥡🍝🍜🥠🥧🍶🍵🧁🥟🍛🍚🍡🍰☕🥃🥃🥤🥢🍽🍴🥄🍴🥄🚂🚞🚋🚃🚄🚌🚍🚅🚆🚎🚐🚇🚈🚑🚒🚉🚊🚓🚔🚝🏍🚥🚨🏎🚜⛽🛢🚛🚚🛤🛣🚙🚘🚏🛴🚗🚖🚲🛵🚕🚦🚢✈🛑🚧🛩🛫⚓⛵🛬💺🛶🚤🚁🚟🛳⛴🚠🚡🛥🛰🏔🏛🏗⛰🚀🛸🌋🧱🏘🗻🌍🌎🏕🏚🏠🏖🌏🌐🏜🏡🏢🏝🗺🗾🏞🏣🏤🏟🧭🏟🏤🏣🏞🏝🏢🏡🏜🎙🎻🥁🎚🎛📯🎭🎤🎧🖼🎨📻🎷🧵🧶🎸🎹🔮🧿🎺🎈🎀🧧✨🧨🎑🎐🎇🎆🎏🎍🎎🎃🎴🀄🎋🎊🃏🧸🎉🎁⏱⏲🎗🎟🕰👓🎫🛎🕶🥽🧳⌛🥼👔⏳⌚👕👖⏰🧣🧤🧥🧦👗👘👙👚👛👜👢💎💍👡👠💄📿🥿🥾⛑🧢👟👞🎓🎩🎒🛍👒👑👝📱🖨⌨📲☎🖱🖲📞📟💽💾📠🔋💿📀🔌💻🧮🎥🖥🔎📙📘🔍📼📗📖📹📸📕📔📷📺🏮🔦🎬📽💡🕯🎞🕯📚📓💡🔦📒📃🏮📔📜📄📕📖📰🗞📗📘📘📑🔖📙💹📦📥🧾💳📤📩💸💷📨📧💶💵💌✉💴💰💲💱🏷📫🖌🖍📪📬📝💼📭📮📁📂🗳✏🗂📅✒🖋📆🖊🗒🖇📎📍📌🇷🇺🇱🇻🇪🇪🇰🇿🇧🇾🇦🇲🏁🇺🇦🇲🇳🚩🎌🇬🇪🇦🇿🏴🏳🇹🇯🇧🇷🏳‍🌈🏴‍☠🇱🇹🇦🇷🇧🇫🇧🇪🇦🇶🇦🇴🇧🇩🇧🇧🇦🇱🇦🇮🇧🇦🇦🇽🇦🇬🇦🇫🇦🇼🇦🇺🇦🇪🇦🇩🇦🇹🇦🇸🇦🇨🇧🇬🇧🇭🇧🇻🇧🇹🇧🇼🇧🇮🇧🇯🇧🇿🇨🇦🇧🇱🇧🇲🇨🇨🇨🇩🇧🇳🇧🇴🇨🇫🇨🇬🇧🇶🇧🇸🇨🇭🇨🇻🇩🇴🇩🇲🇨🇺🇨🇷🇩🇰🇩🇯🇨🇵🇨🇴🇩🇬🇩🇪🇨🇳🇨🇲🇨🇿🇨🇾🇨🇱🇨🇰🇨🇽🇨🇼🇨🇮🇫🇯🇬🇭🇬🇺🇬🇹🇬🇬🇫🇮🇪🇺🇬🇫🇬🇸🇬🇷🇬🇩🇪🇹🇪🇸🇬🇧🇬🇶🇬🇵🇬🇦🇪🇷🇪🇭🇫🇷🇬🇳🇬🇲🇫🇴🇪🇬🇪🇨🇫🇲🇬🇱🇬🇮🇫🇰🇩🇿🇬🇼🇮🇪🇮🇱🇬🇾🇭🇰🇮🇲🇮🇳🇭🇲🇭🇳🇮🇴🇮🇶🇭🇷🇭🇹🇮🇷🇮🇸🇭🇺🇮🇨🇮🇹🇯🇪🇮🇩🇰🇵🇱🇸🇱🇷🇰🇳🇰🇲🇱🇰🇱🇮🇰🇮🇰🇭🇱🇨🇱🇧🇰🇬🇰🇪🇱🇦🇰🇾🇯🇵🇯🇴🇰🇼🇰🇷🇯🇲🇱🇺🇲🇱🇲🇲🇱🇾🇲🇦🇲🇴🇲🇵🇲🇨🇲🇩🇲🇶🇲🇷🇲🇪🇲🇫🇲🇸🇲🇹🇲🇬🇲🇭🇲🇺🇲🇻🇲🇰🇳🇮🇵🇫🇵🇪🇳🇬🇳🇫🇵🇦🇴🇲🇳🇪🇳🇨🇳🇿🇳🇺🇳🇦🇲🇿🇳🇷🇳🇵🇲🇾🇲🇽🇳🇴🇳🇱🇲🇼🇵🇼🇸🇩🇸🇧🇸🇨🇵🇹🇵🇸🇵🇷🇸🇦🇷🇼🇵🇳🇵🇲🇷🇸🇷🇴🇵🇱🇵🇰🇷🇪🇶🇦🇵🇭🇵🇬🇵🇾🇸🇪🇸🇷🇸🇸🇸🇬🇸🇭🇸🇹🇸🇻🇸🇮🇸🇯🇸🇽🇸🇾🇸🇰🇸🇱🇸🇿🇹🇦🇸🇲🇸🇳🇹🇨🇹🇩🇸🇴🇹🇹🇹🇷🇺🇿🇻🇦🇺🇾🇹🇴🇹🇳🇺🇸🇺🇳🇹🇲🇹🇱🇺🇲🇺🇬🇹🇰🇹🇭🇹🇿🇹🇼🇹🇬🇹🇫🇹🇻🇻🇨🇾🇹🇿🇲🇿🇦🇻🇪🇻🇬🇻🇮🇿🇼🇻🇳🇻🇺🇼🇫🇼🇸🇽🇰🇾🇪📋📊📉📈📇🗓📏🔑🗝📐✂🔨⛏🗃🗄⚒🛠🗑🔒🗡⚔🔓🔏🔪🔫🔐🧰💊💉⛓🔗📡🔭⚖🗜🔬🧬⚙🔩🧫🧪🔧🛡⚗🧲🏹🚪🧻🧼🛏🛋🧽🧯🚽🚿🛒🚬🛁🧴⚰⚱🧷🧹🏺🗿🧺🏖🏠🏚🏕🗻🏘🏗🧱🌋⛰🏔🏛🏛🏥💒🗼🏦🏨🗽⛪🏩🏪🕌🕍🏫🏬⛩🕋🏭🏯⛲⛺🏰🌌♨🌉🌇🌆🌅🌄🏙🌃🌁🎠🎡🎢💈🎪')

						#не записываем
						if any((c in chars) for c in msg):
							print('TARGET TERMINATED')
						#записываем
						else:
							print('SUCCESSFULLY')
							if msg != ' ':

								f = open('chat_logs.txt' , 'a+')
								f.write(msg + '\n')
								f.close()

								slow = 2
								slowcheck = random.randint(0, 2)
								line = random.choice(open('chat_logs.txt').readlines())

								if slowcheck == slow:
									sender(id, f' ' + line)
						#не записываем
						if msg in ['бот команды','команды']:
							sender(id, f'''
									Бот ент- предсказывает сколько ты наберешь на ент
									Бот статья - РАНДОМНАЯ СТАТЬЯ SCP
									Бот правила - правила
									Жумайсынба - лучший шампунь в мире
									Бот кто я - говорит кто ты
										''')

						if msg == 'Скажи что нибудь':
							sender(id, f' ' + random.choice(open('chat_logs.txt').readlines()) + " " + random.choice(open('chat_logs.txt').readlines()))

						if msg  == 'Правила':
							sender(id, f'''1.Спам - мут, в последствии кик
										   2.Все что считается рекламой по моему мнению бан
										   3.Не оскорблять администрацию
										   ''')

						if msg in['кто я','сука кто я','бот кто я','как меня зовут','хто я']:
							x = ['Ты','Все знают что ты ']
							y = ['аномальный','стреляющий лазерами из глаз','светящийся','холодный','горячий','коммунистический','капиталистический','вылезщий из пещеры','голубой','ломающийся','земляной','кофейный','высокий','тощий','жирный','скользящий','музыкальный','боевой','примерный','квадратичный','газообразный','жидкий','твердый','глупенький','латексный','желтый','синий','архивированый','кожанный ']
							z = ['Сталин','гей','камень','девственник','тостер','холодильник','арбуз','Курт Кобейн','Цой','болт','шейкер','тюлень','ЭмО','панк','жираф','физико математик','объект','кумыс','двойник путина','тройник Путина','вульф','windows','linuks','банан','дневник','провод','шнур','кейкап']
							xone = random.choice(x)
							yone = random.choice(y)
							zone = random.choice(z)
							ktoya=str(xone) + ' ' + str(yone) + ' ' + str(zone)
							skobka1 = '('
							skobka2 = ')'
							sender(id,f'@id{event.user_id} '+str(skobka1)+str(ktoya)+str(skobka2) )
						

						if msg in ['нет','ytn','нeт ']:
							sender(id, f'  не неткай')

						if msg == 'Бот ент':
							sender(id, f'  Ты наберешь на ент ' + str(random.randint(0, 140)) + ' баллов')

						if msg == 'ладно':
							sender(id, f'  прохладно')

						if msg in ['жумайсымба','жумайсынба']:
							sender(id, f'Раньше из-за перхоти я не мог носить чёрный кожак, здороваться с братками. Потом один из моих братков посоветовал мне шампунь “Жумайсынба”. После первого применения я сразу же увидел результат, и теперь я могу спокойно здороваться с братками и радоваться жизни. Шампунь “Жумайсынба”. Скажи перхоти: “Көзіме көрінбейтін бол э, түсіндің ба!”')
							sender_img(id, f'photo-180738909_457241595')

						if msg == 'бот статья':
							sender(id, f'Стоит прочитать '+str(random.choice(g)))

						elif msg == 'Как дела?':
							sender(id, f'Нормально, y тебя как?')
